adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 22 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_23</name>
                    <description>Interrupt number</description>
                    <lsb>23</lsb>
                    <msb>23</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 23 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 23 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_24</name>
                    <description>Interrupt number</description>
                    <lsb>24</lsb>
                    <msb>24</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 24 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 24 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_25</name>
                    <description>Interrupt number</description>
                    <lsb>25</lsb>
                    <msb>25</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 25 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 25 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_26</name>
                    <description>Interrupt number</description>
                    <lsb>26</lsb>
                    <msb>26</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 26 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 26 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_27</name>
                    <description>Interrupt number</description>
                    <lsb>27</lsb>
                    <msb>27</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 27 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 27 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_28</name>
                    <description>Interrupt number</description>
                    <lsb>28</lsb>
                    <msb>28</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 28 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 28 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_29</name>
                    <description>Interrupt number</description>
                    <lsb>29</lsb>
                    <msb>29</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 29 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 29 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_30</name>
                    <description>Interrupt number</description>
                    <lsb>30</lsb>
                    <msb>30</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 30 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 30 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>INT_31</name>
                    <description>Interrupt number</description>
                    <lsb>31</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Secure</name>
                        <description>The interrupt 31 is secure</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>NonSecure</name>
                        <description>The interrupt 31 is non-secure</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
        </cluster>
        <cluster>
          <name>DPPI</name>
          <description>Unspecified</description>
          <headerStructName>UICR_DPPI</headerStructName>
          <access>read-write</access>
          <addressOffset>0x4E0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x014</dimIncrement>
            <name>LOCAL[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_DPPI_LOCAL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>INSTANCE</name>
              <description>Description cluster: Address of the DPPI instance associated with DPPI[n].LOCAL</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <description>Instance address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
