adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
            <register>
              <name>SECURE</name>
              <description>Request permission for the CCs of GRTC</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CC_0</name>
                  <description>Capture/compare register number</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 0 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 0 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_1</name>
                  <description>Capture/compare register number</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 1 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 1 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_2</name>
                  <description>Capture/compare register number</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 2 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 2 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_3</name>
                  <description>Capture/compare register number</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 3 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 3 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_4</name>
                  <description>Capture/compare register number</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 4 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 4 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_5</name>
                  <description>Capture/compare register number</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 5 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 5 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_6</name>
                  <description>Capture/compare register number</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 6 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 6 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_7</name>
                  <description>Capture/compare register number</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 7 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 7 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_8</name>
                  <description>Capture/compare register number</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 8 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 8 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_9</name>
                  <description>Capture/compare register number</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 9 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 9 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_10</name>
                  <description>Capture/compare register number</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 10 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 10 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_11</name>
                  <description>Capture/compare register number</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 11 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 11 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_12</name>
                  <description>Capture/compare register number</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 12 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 12 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_13</name>
                  <description>Capture/compare register number</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 13 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 13 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_14</name>
                  <description>Capture/compare register number</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 14 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 14 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>CC_15</name>
                  <description>Capture/compare register number</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Secure</name>
                      <description>The CC register 15 is secure</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NonSecure</name>
                      <description>The CC register 15 is non-secure</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <dim>0x10</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>IPCMAP[%s]</name>
          <description>Description collection: Request configuration for the channel n of IPCMAP</description>
          <addressOffset>0x680</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IPCTCHSINK</name>
              <description>IPCT channel number (sink side)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DOMAINIDSINK</name>
              <description>Domain ID (sink side)</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>IPCTCHSOURCE</name>
              <description>IPCT channel number (source side)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DOMAINIDSOURCE</name>
              <description>Domain ID (source side)</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>MAILBOX[%s]</name>
          <description>Unspecified</description>
          <headerStructName>UICR_MAILBOX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <register>
            <name>ADDRESS</name>
            <description>Description cluster: Memory start address of mailbox n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Memory address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Configuration of mailbox n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SECURE</name>
                <description>Permission</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>The mailbox memory is secure</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>The mailbox memory is non-secure</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OWNERID</name>
                <description>Remote owner identification</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SIZE</name>
                <description>Memory size</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRACE</name>
          <description>Unspecified</description>
          <headerStructName>UICR_TRACE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x740</addressOffset>
          <cluster>
            <name>ETBSINK</name>
            <description>Unspecified</description>
            <headerStructName>UICR_TRACE_ETBSINK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>SOURCES</name>
              <description>Unspecified</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STMMAINCORE</name>
                  <description>STM trace from the domain main CPU</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ETMMAINCORE</name>
                  <description>ETM trace from the domain main CPU</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMHWEVENTS</name>
                  <description>STM HW events trace</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMPPR</name>
                  <description>STM trace from PPR CPU</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMFLPR</name>
                  <description>STM trace from FLPR CPU</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMBBPR</name>
                  <description>STM trace from BBPR CPU</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
