adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <cluster>
            <name>TPIUSINK</name>
            <description>Unspecified</description>
            <headerStructName>UICR_TRACE_TPIUSINK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x004</addressOffset>
            <register>
              <name>SOURCES</name>
              <description>Unspecified</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STMMAINCORE</name>
                  <description>STM trace from the domain main CPU</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ETMMAINCORE</name>
                  <description>ETM trace from the domain main CPU</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMHWEVENTS</name>
                  <description>STM HW events trace</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMPPR</name>
                  <description>STM trace from PPR CPU</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMFLPR</name>
                  <description>STM trace from FLPR CPU</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMBBPR</name>
                  <description>STM trace from BBPR CPU</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>ETRSINK</name>
            <description>Unspecified</description>
            <headerStructName>UICR_TRACE_ETRSINK</headerStructName>
            <access>read-write</access>
            <addressOffset>0x008</addressOffset>
            <register>
              <name>SOURCES</name>
              <description>Unspecified</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STMMAINCORE</name>
                  <description>STM trace from the domain main CPU</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ETMMAINCORE</name>
                  <description>ETM trace from the domain main CPU</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMHWEVENTS</name>
                  <description>STM HW events trace</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMPPR</name>
                  <description>STM trace from PPR CPU</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMFLPR</name>
                  <description>STM trace from FLPR CPU</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STMBBPR</name>
                  <description>STM trace from BBPR CPU</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotRequested</name>
                      <description>Not Requested</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Requested</name>
                      <description>Requested</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>PORTCONFIG</name>
            <description>Trace port speed configuration</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PORTCONFIG</name>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FullSpeed</name>
                    <description>Full speed</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HalfSpeed</name>
                    <description>Half speed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>QuarterSpeed</name>
                    <description>One quarter speed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EightSpeed</name>
                    <description>One eigth speed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TAMPER</name>
          <description>Unspecified</description>
          <headerStructName>UICR_TAMPER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x760</addressOffset>
          <cluster>
            <name>DETECTION</name>
            <description>Tamper policy configuration for detected security events.</description>
            <headerStructName>UICR_TAMPER_DETECTION</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Unspecified</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>GlobalEnable</name>
                  <description>Enable tamper detection. When disabled all tamper enable and policy switches are ignored.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable tamper detection.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable tamper detection.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>VoltageLevel</name>
                  <description>Enable voltage level detectors (VDETs) on supply lines. An automatic system reset is issued when voltage on the corresponding supply line is too low.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable voltage level detectors.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable voltage level detectors.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>Watchdog</name>
                  <description>Reserved field, as watchdog timer is always enabled.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                </field>
                <field>
                  <name>ExternalTamperSwitch</name>
                  <description>Enable external tamper switch detector.</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable external tamper switch detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable external tamper switch detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ExternalActiveShield</name>
                  <description>Enable external active shield detector.</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable external active shield detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable external active shield detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>InternalActiveShield</name>
                  <description>Enable internal active shield detector.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable internal active shield detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable internal active shield detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>InternalDetectors</name>
                  <description>Reserved field, as internal detectors are always enabled.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                </field>
                <field>
                  <name>HardFault</name>
                  <description>Configure if tamper prevention should react on hard faults.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable hard fault detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable hard fault detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ApiFault</name>
                  <description>Configure if tamper prevention should react on invalid API usage.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable API fault detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable API fault detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>AdacFault</name>
                  <description>Configure if tamper prevention should react on invalid ADAC usage.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable invalid ADAC usage detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable invalid ADAC usage detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>StateFault</name>
                  <description>Configure if tamper prevention should react on invalid firmware execution state.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable invalid firmware execution state detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable invalid firmware execution state detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TemperatureFault</name>
                  <description>Configure if tamper prevention should react when on-die temperature exceeds a valid range.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable invalid out-of-range temperature detector.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable invalid out-of-range temperature detector.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
