adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DCACHEINFO_S</name>
      <description>CACHEINFO</description>
      <baseAddress>0x23F10000</baseAddress>
      <headerStructName>DCACHEINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DCACHEINFO</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>256</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>SET[%s]</name>
          <description>Unspecified</description>
          <headerStructName>DCACHEINFO_SET</headerStructName>
          <access>read-write</access>
          <addressOffset>0x0</addressOffset>
          <cluster>
            <dim>2</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>WAY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>DCACHEINFO_SET_WAY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x0</addressOffset>
            <register>
              <name>INFO</name>
              <description>Description cluster: Cache information for SET[n], WAY[o].</description>
              <addressOffset>0x0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAG</name>
                  <description>Cache tag.</description>
                  <lsb>0</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>DUV_0</name>
                  <description>Data unit valid info.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_1</name>
                  <description>Data unit valid info.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_2</name>
                  <description>Data unit valid info.</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUV_3</name>
                  <description>Data unit valid info.</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D0</name>
                  <description>Dirty status of combined data unit 0 and 1.</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D1</name>
                  <description>Dirty status of combined data unit 2 and 3.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>V</name>
                  <description>Line valid bit.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid cache line</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid cache line</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MRU</name>
                  <description>Most recently used way.</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Way0</name>
                      <description>Way0 was most recently used</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Way1</name>
                      <description>Way1 was most recently used</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>INFOEXT</name>
              <description>Description cluster: Extended cache information for SET[n], WAY[o].</description>
              <addressOffset>0x4</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>D_0</name>
                  <description>Dirty status.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_1</name>
                  <description>Dirty status.</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_2</name>
                  <description>Dirty status.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_3</name>
                  <description>Dirty status.</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_4</name>
                  <description>Dirty status.</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_5</name>
                  <description>Dirty status.</description>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_6</name>
                  <description>Dirty status.</description>
                  <lsb>22</lsb>
                  <msb>22</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>D_7</name>
                  <description>Dirty status.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Clean</name>
                      <description>Clean data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Dirty</name>
                      <description>Dirty data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUVEXT_0</name>
                  <description>Extended data unit valid info.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUVEXT_1</name>
                  <description>Extended data unit valid info.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUVEXT_2</name>
                  <description>Extended data unit valid info.</description>
                  <lsb>26</lsb>
                  <msb>26</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DUVEXT_3</name>
                  <description>Extended data unit valid info.</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Invalid</name>
                      <description>Invalid data unit</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Valid</name>
                      <description>Valid data unit</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
