adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_I3CCORE120_NS">
      <name>GLOBAL_I3CCORE121_NS</name>
      <description>I3CCORE 1</description>
      <baseAddress>0x2FBE1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
    </peripheral>
    <peripheral>
      <name>GLOBAL_DMU120_NS</name>
      <description>DMU</description>
      <baseAddress>0x2FBEF800</baseAddress>
      <headerStructName>DMU</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>DMU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>DMUCR</name>
          <description>DMU Core Release</description>
          <addressOffset>0x3C0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>YEAR</name>
              <description>Time Stamp Year</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>MON</name>
              <description>Time Stamp Month</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DAY</name>
              <description>Time Stamp Day</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMUI</name>
          <description>DMU Internals</description>
          <addressOffset>0x3C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00070000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXR</name>
              <description>TX Service Request line of DMU</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRequested</name>
                  <description>No TX DMA service requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Requested</name>
                  <description>TX DMA Service requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0R</name>
              <description>RX0 Service Request line of DMU</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRequested</name>
                  <description>No RX0 DMA service requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Requested</name>
                  <description>RX0 DMA Service requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1R</name>
              <description>RX1 Service Request line of DMU</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRequested</name>
                  <description>No RX1 DMA service requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Requested</name>
                  <description>RX1 DMA Service requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXER</name>
              <description>TX Event Service Request line of DMU</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotRequested</name>
                  <description>No TX Event DMA service requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Requested</name>
                  <description>TX Event DMA Service requested</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFQPIP</name>
              <description>TX FIFO/Queue Put Index Previous</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>ENA</name>
              <description>DMU is enabled</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DMU is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DMU is enabled and can process DMA data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEHS</name>
              <description>Detect Element Handler State</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>DTX</name>
              <description>Detect DMU Element Service</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Queueing of DMU Element does not activate interrupt flag</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Queueing of DMU Element will activate interrupt flag when DMUI.EHS = DMUI.DEHS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRX0</name>
              <description>Detect DMU Element Service</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Queueing of DMU Element does not activate interrupt flag</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Queueing of DMU Element will activate interrupt flag when DMUI.EHS = DMUI.DEHS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRX1</name>
              <description>Detect DMU Element Service</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Queueing of DMU Element does not activate interrupt flag</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Queueing of DMU Element will activate interrupt flag when DMUI.EHS = DMUI.DEHS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTXE</name>
              <description>Detect DMU Element Service</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Queueing of DMU Element does not activate interrupt flag</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Queueing of DMU Element will activate interrupt flag when DMUI.EHS = DMUI.DEHS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EHS</name>
              <description>Element Handler State</description>
              <lsb>24</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>wait4cce</name>
                  <description>wait for bit MCAN:CCCR.CCE getting zero</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wait4sa</name>
                  <description>wait for Start Address</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>wait4ta</name>
                  <description>wait for Trigger Address</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>transfer</name>
                  <description>wait for transfer of Element word</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ack2mcan</name>
                  <description>acknowledge to MCAN</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>recovery</name>
                  <description>exception recovery</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TX</name>
              <description>Actual DMU Element Service</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotServed</name>
                  <description>DMU Virtual Buffer is currently not served</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Served</name>
                  <description>DMU Virtual Buffer is currently served</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX0</name>
              <description>Actual DMU Element Service</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotServed</name>
                  <description>DMU Virtual Buffer is currently not served</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Served</name>
                  <description>DMU Virtual Buffer is currently served</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX1</name>
              <description>Actual DMU Element Service</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotServed</name>
                  <description>DMU Virtual Buffer is currently not served</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Served</name>
                  <description>DMU Virtual Buffer is currently served</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXE</name>
              <description>Actual DMU Element Service</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotServed</name>
                  <description>DMU Virtual Buffer is currently not served</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Served</name>
                  <description>DMU Virtual Buffer is currently served</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMUQC</name>
          <description>DMU Queueing Counter</description>
          <addressOffset>0x3C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXEEC</name>
              <description>TX Element Enqueueing Counter</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>RX0EDC</name>
              <description>RX0 Element Dequeueing Counter</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>RX1EDC</name>
              <description>RX1 Element Dequeueing Counter</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TXEEDC</name>
              <description>TX Event Element Dequeueing Counter</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
