adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>TRCCLAIMCLR</name>
          <description>Clears bits in the claim tag and determines the current value of the claim tag.</description>
          <addressOffset>0xFA4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CLR_0</name>
              <description>Claim tag clear register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 0 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 0 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim tag 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_1</name>
              <description>Claim tag clear register</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 1 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 1 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim tag 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_2</name>
              <description>Claim tag clear register</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 2 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 2 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim tag 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_3</name>
              <description>Claim tag clear register</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotSet</name>
                  <description>Claim tag 3 is not set.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Claim tag 3 is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clear claim tag 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCAUTHSTATUS</name>
          <description>Indicates the current level of tracing permitted by the system</description>
          <addressOffset>0xFB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NSID</name>
              <description>Non-secure Invasive Debug</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSNID</name>
              <description>Non-secure Non-Invasive Debug</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SID</name>
              <description>Secure Invasive Debug</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNID</name>
              <description>Secure Non-Invasive Debug</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotImplemented</name>
                  <description>The feature is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Implemented</name>
                  <description>The feature is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCDEVARCH</name>
          <description>The TRCDEVARCH identifies ETM-M33 as an ETMv4.2 component</description>
          <addressOffset>0xFBC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ARCHID</name>
              <description>Architecture ID</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ETMv42</name>
                  <description>Component is an ETMv4 component</description>
                  <value>0x4A13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVISION</name>
              <description>Architecture revision</description>
              <lsb>16</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>v2</name>
                  <description>Component is part of architecture 4.2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESENT</name>
              <description>This register is implemented</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Absent</name>
                  <description>The register is not implemented.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Present</name>
                  <description>The register is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARCHITECT</name>
              <description>Defines the architect of the component</description>
              <lsb>21</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Arm</name>
                  <description>This peripheral was architected by Arm.</description>
                  <value>0x23B</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRCDEVTYPE</name>
          <description>Controls the single-shot comparator.</description>
          <addressOffset>0xFCC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAJOR</name>
              <description>The main type of the component</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TraceSource</name>
                  <description>Peripheral is a trace source.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUB</name>
              <description>The sub-type of the component</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ProcessorTrace</name>
                  <description>Peripheral is a processor trace source.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TRCPIDR[%s]</name>
          <description>Description collection: Coresight peripheral identification registers.</description>
          <addressOffset>0xFD0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
        <register>
          <dim>0x4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TRCCIDR[%s]</name>
          <description>Description collection: Coresight component identification registers.</description>
          <addressOffset>0xFF0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
        </register>
