adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="RTC_NS">
      <name>RTC_S</name>
      <description>Real-time counter 1</description>
      <baseAddress>0x5302B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>RADIO_NS</name>
      <description>2.4 GHz radio 0</description>
      <baseAddress>0x4302C000</baseAddress>
      <headerStructName>RADIO</headerStructName>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RADIO_0</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>RADIO_1</name>
        <value>45</value>
      </interrupt>
      <groupName>RADIO</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_TXEN</name>
          <description>Enable RADIO in TX mode</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_TXEN</name>
              <description>Enable RADIO in TX mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RXEN</name>
          <description>Enable RADIO in RX mode</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RXEN</name>
              <description>Enable RADIO in RX mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_START</name>
          <description>Start RADIO</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_START</name>
              <description>Start RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STOP</name>
          <description>Stop RADIO</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_STOP</name>
              <description>Stop RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DISABLE</name>
          <description>Disable RADIO</description>
          <addressOffset>0x010</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_DISABLE</name>
              <description>Disable RADIO</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RSSISTART</name>
          <description>Start the RSSI and take one single sample of the receive signal strength</description>
          <addressOffset>0x014</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RSSISTART</name>
              <description>Start the RSSI and take one single sample of the receive signal strength</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_BCSTART</name>
          <description>Start the bit counter</description>
          <addressOffset>0x018</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_BCSTART</name>
              <description>Start the bit counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_BCSTOP</name>
          <description>Stop the bit counter</description>
          <addressOffset>0x01C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_BCSTOP</name>
              <description>Stop the bit counter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EDSTART</name>
          <description>Start the energy detect measurement used in IEEE 802.15.4 mode</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_EDSTART</name>
              <description>Start the energy detect measurement used in IEEE 802.15.4 mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EDSTOP</name>
          <description>Stop the energy detect measurement</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_EDSTOP</name>
              <description>Stop the energy detect measurement</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CCASTART</name>
          <description>Start the clear channel assessment used in IEEE 802.15.4 mode</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CCASTART</name>
              <description>Start the clear channel assessment used in IEEE 802.15.4 mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CCASTOP</name>
          <description>Stop the clear channel assessment</description>
          <addressOffset>0x02C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CCASTOP</name>
              <description>Stop the clear channel assessment</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFESTART</name>
          <description>Start DFE operation</description>
          <addressOffset>0x030</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_DFESTART</name>
              <description>Start DFE operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFESTOP</name>
          <description>Stop DFE operation</description>
          <addressOffset>0x034</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_DFESTOP</name>
              <description>Stop DFE operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ0DMASTART</name>
          <description>Start DMA transaction</description>
          <addressOffset>0x038</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACQINJ0DMASTART</name>
              <description>Start DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ0DMASTOP</name>
          <description>Stop ongoing DMA transaction</description>
          <addressOffset>0x03C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACQINJ0DMASTOP</name>
              <description>Stop ongoing DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ1DMASTART</name>
          <description>Start DMA transaction</description>
          <addressOffset>0x040</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACQINJ1DMASTART</name>
              <description>Start DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_ACQINJ1DMASTOP</name>
          <description>Stop ongoing DMA transaction</description>
          <addressOffset>0x044</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_ACQINJ1DMASTOP</name>
              <description>Stop ongoing DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_LOOPBACKEN</name>
          <description>Enable RADIO in LOOPBACK mode</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_LOOPBACKEN</name>
              <description>Enable RADIO in LOOPBACK mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CALSTART</name>
          <description>Start calibration</description>
          <addressOffset>0x058</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CALSTART</name>
              <description>Start calibration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CALSTOP</name>
          <description>Stop calibration</description>
          <addressOffset>0x05C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CALSTOP</name>
              <description>Stop calibration</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CHNOINCR</name>
          <description>Update RADIO channel based on the current channel and increment it according to chNoIncrStep</description>
          <addressOffset>0x068</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CHNOINCR</name>
              <description>Update RADIO channel based on the current channel and increment it according to chNoIncrStep</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFEDMASTART</name>
          <description>Start DFE DMA transaction</description>
          <addressOffset>0x074</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_DFEDMASTART</name>
              <description>Start DFE DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DFEDMASTOP</name>
          <description>Stop ongoing DFE DMA transaction</description>
          <addressOffset>0x078</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_DFEDMASTOP</name>
              <description>Stop ongoing DFE DMA transaction</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_RELOADFREQ</name>
          <description>Reload new frequency while radio PLL is active</description>
          <addressOffset>0x07C</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_RELOADFREQ</name>
              <description>Reload new frequency while radio PLL is active</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_CSTONESSTART</name>
          <description>Channel sounding: Start tone processing</description>
          <addressOffset>0x0A0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_CSTONESSTART</name>
              <description>Channel sounding: Start tone processing</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_SOFTRESET</name>
          <description>Reset all public registers, but with these exceptions: DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH registers. Only to be used in DISABLED state.</description>
          <addressOffset>0x0A4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TASKS_SOFTRESET</name>
              <description>Reset all public registers, but with these exceptions: DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH registers. Only to be used in DISABLED state.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
