adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>INTPEND11</name>
          <description>Pending interrupts</description>
          <addressOffset>0x4BC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXTIMERMATCH</name>
              <description>Read pending status of interrupt for event TXTIMERMATCH</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXTIMERMATCH</name>
              <description>Read pending status of interrupt for event RXTIMERMATCH</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BESPOKEACK</name>
              <description>Read pending status of interrupt for event BESPOKEACK</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXADDRESS</name>
              <description>Read pending status of interrupt for event TXADDRESS</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXADDRESS</name>
              <description>Read pending status of interrupt for event RXADDRESS</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACQINJ0DMAEND</name>
              <description>Read pending status of interrupt for event ACQINJ0DMAEND</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACQINJ1DMAEND</name>
              <description>Read pending status of interrupt for event ACQINJ1DMAEND</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSTONESEND</name>
              <description>Read pending status of interrupt for event CSTONESEND</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Data rate and modulation</description>
          <addressOffset>0x500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Radio data rate and modulation setting. The radio supports frequency-shift keying (FSK) modulation.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Nrf_1Mbit</name>
                  <description>1 Mbps Nordic proprietary radio mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_2Mbit</name>
                  <description>2 Mbps Nordic proprietary radio mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_250Kbit</name>
                  <description>Deprecated enumerator -  250 kbps Nordic proprietary radio mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_1Mbit</name>
                  <description>1 Mbps BLE</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_2Mbit</name>
                  <description>2 Mbps BLE</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR125Kbit</name>
                  <description>Long range 125 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ble_LR500Kbit</name>
                  <description>Long range 500 kbps TX, 125 kbps and 500 kbps RX</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit0_5</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.5)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Nrf_4Mbit0_25</name>
                  <description>4 Mbps Nordic proprietary radio mode (BT=0.5/h=0.25)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee802154_250Kbit</name>
                  <description>IEEE 802.15.4-2006 250 kbps</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEINTERNAL</name>
          <description>Internal mode setting, active only when MODEPROGENABLE==1</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODEINTERNAL</name>
              <description>Radio data rate and modulation setting. Same definition as MODE.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEPROGENABLE</name>
          <description>Switch that enables programmable modes</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODEPROGENABLE</name>
              <description>Enable manual triggering of MODEREADY event and activate MODEINTERNAL register (ie. MODEINTERNAL overrides MODE register)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECNF</name>
          <description>Radio mode configuration register</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ZEROIF</name>
              <description>Zero-IF mode</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Default mode (heterodyne)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZeroIF</name>
                  <description>Zero-IF mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSEL</name>
              <description>Sideband select</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low-side LO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High-side LO</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTX</name>
              <description>Default TX value. Specifies what the RADIO will transmit when it is not started, i.e.
          between:
          RADIO.EVENTS_READY and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.TASKS_START
          RADIO.EVENTS_END and RADIO.EVENTS_DISABLED)</description>
              <lsb>3</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B1</name>
                  <description>Transmit '1'</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B0</name>
                  <description>Transmit '0'</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Center</name>
                  <description>Transmit center frequency
          When tuning the crystal for centre frequency, the RADIO must
          be set in DTX = Center mode to be able to achieve the expected
          accuracy. This is only a valid setting for Nrf_1Mbit, Nrf_2Mbit,
          Nrf_250kbit, Ble_1Mbit and Ble_2Mbit.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODLOOPBACK</name>
              <description>Loopback from IQ modulator</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Digital loopback off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Digital loopback on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQRAMSEL</name>
              <description>IQ RAM select</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>off</name>
                  <description>IQ RAM select off</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>on</name>
                  <description>IQ RAM select on</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC</name>
          <description>Misc configuration collection (to be renamed when more bits are defined)</description>
          <addressOffset>0x514</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DISABLEADDRWINDOW</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCFREEZEAFTERREF</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EntireCTE</name>
                  <description>Gain freeze will apply to whole CTE,</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AfterRefPeriod</name>
                  <description>Gain freeze will apply to only after reference period of CTE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCFREEZEGAINENABLE</name>
              <description>Override AGC gain setting during CTE (from QOVERRIDE10)</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Adjust</name>
                  <description>AGC gain settings will keep adjusting during CTE</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Freeze</name>
                  <description>AGC gain settings will freeze (not keep adjusting) during CTE</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Current radio state</description>
          <addressOffset>0x520</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>Current radio state</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>RADIO is in the Disabled state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxRu</name>
                  <description>RADIO is in the RXRU state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxIdle</name>
                  <description>RADIO is in the RXIDLE state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Rx</name>
                  <description>RADIO is in the RX state</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RxDisable</name>
                  <description>RADIO is in the RXDISABLED state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxRu</name>
                  <description>RADIO is in the TXRU state</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxIdle</name>
                  <description>RADIO is in the TXIDLE state</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Tx</name>
                  <description>RADIO is in the TX state</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TxDisable</name>
                  <description>RADIO is in the TXDISABLED state</description>
                  <value>0xC</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EDCTRL</name>
          <description>IEEE 802.15.4 energy detect control</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDCNT</name>
              <description>IEEE 802.15.4 energy detect loop count</description>
              <lsb>0</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>EDPERIOD</name>
              <description>IEEE 802.15.4 energy detect period, 4us resolution, no averaging except the IEEE 802.15.4 ED range 128us (32)</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EDSAMPLE</name>
          <description>IEEE 802.15.4 energy detect level</description>
          <addressOffset>0x534</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EDLVL</name>
              <description>IEEE 802.15.4 energy detect level</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CCACTRL</name>
          <description>IEEE 802.15.4 clear channel assessment control</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <resetValue>0x052D0000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CCAMODE</name>
              <description>CCA mode of operation</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EdMode</name>
                  <description>Energy above threshold</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierMode</name>
                  <description>Carrier seen</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierAndEdMode</name>
                  <description>Energy above threshold AND carrier seen</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CarrierOrEdMode</name>
                  <description>Energy above threshold OR carrier seen</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EdModeTest1</name>
                  <description>Energy above threshold test mode that will abort when first ED measurement over threshold is seen. No averaging.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCAEDTHRES</name>
              <description>CCA energy busy threshold. Used in all the CCA modes except CarrierMode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CCACORRTHRES</name>
              <description>CCA correlator busy threshold. Only relevant to CarrierMode, CarrierAndEdMode, and CarrierOrEdMode.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>CCACORRCNT</name>
              <description>Limit for occurances above CCACORRTHRES. When not equal to zero the corrolator based signal detect is enabled.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
