adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <register>
            <name>RESULT</name>
            <description>Calibration result</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RCCALCODE</name>
                <description>Calibration result from RC calibration</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>RFMIXDCCALI</name>
                <description>Calibration result from DC offset calibration on channel I</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>RFMIXDCCALQ</name>
                <description>Calibration result from DC offset calibration on channel Q</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SPHYNXANATEST</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_SPHYNXANATEST</headerStructName>
          <access>read-write</access>
          <addressOffset>0x730</addressOffset>
          <register>
            <name>TEST</name>
            <description>Control of analog and digital test bus output from Sphynx</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXATEBIASFS</name>
                <description>Analog test enable for BIAS_FS</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SPHYNXATEFS</name>
                <description>Analog test enable for FS</description>
                <lsb>4</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>SPHYNXATERXMIX</name>
                <description>Analog test enable for RX MIX</description>
                <lsb>11</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>SPHYNXATERXAAF</name>
                <description>Analog test enable for RX AAF</description>
                <lsb>13</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SPHYNXATERXTX</name>
                <description>Analog test enable for RX TX</description>
                <lsb>19</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>SPHYNXATETXPWRCTRL</name>
                <description>Analog test enable for TX PWRCTRL</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>SPHYNXDTEFS</name>
                <description>Digital test enable for digital logic in analog macro</description>
                <lsb>26</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>SPHYNXANA</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_SPHYNXANA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x734</addressOffset>
          <register>
            <name>FSCTRL0</name>
            <description>Control to frequency synthesizer of Sphynx</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xA0C58400</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXFSLDOBYPASS</name>
                <description>Bypass FS LDOs</description>
                <lsb>0</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SPHYNXFSVCOCTRL</name>
                <description>Spare, not used</description>
                <lsb>6</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>SPHYNXFSVCOSWREF</name>
                <description>FS swing calibration</description>
                <lsb>10</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>SPHYNXFSDIV2CM</name>
                <description>Spare, not used</description>
                <lsb>15</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SPHYNXFSDIV2CTRL</name>
                <description>Spare, not used</description>
                <lsb>19</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>SPHYNXFSDIV2OSC</name>
                <description>Spare, not used</description>
                <lsb>22</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SPHYNXFSDTCCTRL</name>
                <description>DTC control</description>
                <lsb>27</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>SPHYNXFSDTCEDGEALIGN</name>
                <description>Resync at flip flop inside DTC</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FSCTRL1</name>
            <description>Control to frequency synthesizer of Sphynx</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00010060</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXFSREFIPPTRIM</name>
                <description>For current calibration</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SPHYNXFSREFVTTRIM</name>
                <description>For voltage tuning of reference</description>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>SPHYNXFSDIV2ISW</name>
                <description>[2:0] Adjust voltage for back bias of injection switch; [3] Spare</description>
                <lsb>14</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>SPHYNXFSTDCCTRL</name>
                <description>Spare, not used</description>
                <lsb>18</lsb>
                <msb>20</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FSCTRL2</name>
            <description>Control to frequency synthesizer of Sphynx</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXBIASTXVREFCFG</name>
                <description>BIAS_RXTX_CFG[3:0]: Used for changing TX_PA_GF22N supply. BIAS_TX_VREF_CFG_1V8[3:0] bus in BIAS_TX_VREF_CFG.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SPHYNXBIASRESPROCESS</name>
                <description>BIAS_RXTX_CFG[5:4]: RES_PROCESS_1V8[1:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP</description>
                <lsb>4</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SPHYNXBIASVREFTRIM</name>
                <description>BIAS_RXTX_CFG[9:6]: 2's complement trimming code for VREF_SWAT and IBPSR_4U. VREF_TRIM_1V8[3:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP.</description>
                <lsb>6</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>SPHYNXBIASIBPPTRIM</name>
                <description>BIAS_RXTX_CFG[13:10]: 2's complement trimming code for IBPP_4U. IBPP_TRIM_1V8[3:0] bus in BIAS_SWAT_IBP_BJT_SPHYNX_WRAP.</description>
                <lsb>10</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXCTRL</name>
            <description>Control to receiver of Sphynx</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXBYPASSLDORX</name>
                <description>Bypass Rx LDOs</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SPHYNXRXMIXQLEADSI</name>
                <description>1: output from MIX_AMP is Q leading I, 0 output from MIX_AMP is I leading Q</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>SPHYNXRXAAFVCMTRIM</name>
                <description>VCM trim values for RX_AAF</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>SPHYNXLNACFREQ</name>
                <description>LNA center frequency settings</description>
                <lsb>11</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>SPHYNXLNACURR</name>
                <description>LNA current setting</description>
                <lsb>15</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>SPHYNXADCTIMINGCALC</name>
                <description>ADC_CFG_0V8[0]: Calculation of ADC timing margin</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>SPHYNXADCOFFSETCALC</name>
                <description>ADC_CFG_0V8[1]: Enabling of offset calculation</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SPHYNXADCDYNDUC</name>
                <description>ADC_CFG_0V8[2]: Dynamic duty cycle of sampling clock</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>SPHYNXADCRPLCANC</name>
                <description>ADC_CFG_0V8[3]: Reference voltage ripple cancellation mode</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>SPHYNXADCCHRGINJ</name>
                <description>ADC_CFG_0V8[4]: Reference voltage charge injection mode</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>SPHYNXADCVBULKTRIM</name>
                <description>ADC_CFG_0V8[5]: Trim bulks of LVT NFETs</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>ENCWLOOPBACK</name>
                <description>Enable CW loopback</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>RXTUNEIN</name>
                <description>Controls TX_PWR_0V8/PWRCTR_TX_0V9 when in RX or Loopback</description>
                <lsb>25</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TXCTRL</name>
            <description>Control to transmitter of Sphynx</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXBYPASSLDOTX</name>
                <description>Bypass Tx LDOs</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SPHYNXTXPASRAMP</name>
                <description>TX PA ramp up/down control</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>SPHYNXTXPWRCTRLTUNE</name>
                <description>Digital input signal for tapping the resistor-ladder to create reference voltage in accordance with the desired peak</description>
                <lsb>6</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>SPHYNXTXPWRFINE</name>
                <description>Radio Tx output power fine tune</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MODEDEPENDENT</name>
            <description>Mode dependent register of Sphynx</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXRXAAFFREQ</name>
                <description>Select Cut-Off Frequency for the AAF</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>2MHz</name>
                    <description>2 MHz (for 1 MHz IF frequency)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4MHz</name>
                    <description>4 MHz (for 2 MHz IF frequency)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>6MHz</name>
                    <description>6 MHz (for 4 MHz IF frequency)</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRRXTRIMCODE</name>
            <description>Override trim codes to the receiver of Sphynx</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVRVALRCCALCODE1M</name>
                <description>Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 1M)</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>OVRVALRCCALCODE2M</name>
                <description>Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 2M)</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OVRVALRCCALCODE4M</name>
                <description>Override values on RCCAL_CODE and RX_AAF_RCTRIMM (when IF is 4M)</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OVRVALRFMIXDCCALI</name>
                <description>Override values on RXMIX_DCCAL_I_0V8</description>
                <lsb>12</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>OVRVALRFMIXDCCALQ</name>
                <description>Override values on RXMIX_DCCAL_Q_0V8</description>
                <lsb>20</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>OVRENRCCALCODE</name>
                <description>For RCCAL_CODE_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>OVRENRFMIXDCCALI</name>
                <description>For RXMIX_DCCAL_I_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>OVRENRFMIXDCCALQ</name>
                <description>For RXMIX_DCCAL_Q_0V8, 0: controlled by CalibrationEngine, 1: overridden by register</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Readout raw status of signals output from Sphynx</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXADCBIAO</name>
                <description>Raw ADC I channel output from RX_SAR2</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>SPHYNXADCBQAO</name>
                <description>Raw ADC Q channel output from RX_SAR2</description>
                <lsb>11</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>SPHYNXCALCMPRCCALAO</name>
                <description>Raw comparator output of RC calibration from RC_CAL</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>SPHYNXAAFDCCALIAO</name>
                <description>Raw comparator output of DC calibration from RX_AAF I channel</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>SPHYNXAAFDCCALQAO</name>
                <description>Raw comparator output of DC calibration from RX_AAF Q channel</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>SPHYNXRXPKDETAO</name>
                <description>Raw peak detector output from RX_PKDET</description>
                <lsb>25</lsb>
                <msb>26</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRRXGAIN</name>
            <description>Analog rx gain override</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SPHYNXLNAGAINOVREN</name>
                <description>Override enable for LNA_GAIN_0V8, each bit can be overriden individually</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>SPHYNXLNAGAINOVRVAL</name>
                <description>Override value for LNA_GAIN_0V8, each bit can be overriden individually</description>
                <lsb>8</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>SPHYNXRXMIXGAINOVREN</name>
                <description>Override enable for RXMIX_GAIN_0V8, each bit can be overriden individually</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>SPHYNXRXMIXGAINOVRVAL</name>
                <description>Override value for RXMIX_GAIN_0V8, each bit can be overriden individually</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOCKSOURCE</name>
            <description>Choose between two clock sources</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENCK64MBUFSIN</name>
                <description>Enable clock buffer from 64MHz input</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32MHz</name>
                    <description>Use clock from 32MHz XOSC (Lilium)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64MHz</name>
                    <description>Use clock from 64MHz XOSC (Halti)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>TEXTAMP</name>
          <description>Timing control of external RADIO amplifier (LNA/PA)</description>
          <addressOffset>0x76C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00007868</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TPWRUPEXTLNA</name>
              <description>Timing control of PwrupExtLna (unit: 0.25us)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>TPWRUPEXTPA</name>
              <description>Timing control of PwrupExtPa (unit: 0.25us)</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PWRUPEXTLNABEFORERAMPUP</name>
              <description>In legacy timing mode, pwrupExtLna can be powered on before starting to ramp up by setting this registers to 1</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AfterRampup</name>
                  <description>Power up external LNA at (RADIO_rampup_start_time + TPWRUPEXTLNA)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BeforeRampup</name>
                  <description>Power up external LNA at (RADIO_rampup_start_time - TPWRUPEXTLNA)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUPEXTPABEFORERAMPUP</name>
              <description>In legacy timing mode, pwrupExtPa can be powered on before starting to ramp up by setting this registers to 1</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AfterRampup</name>
                  <description>Power up external PA at (RADIO_rampup_start_time + TPWRUPEXTPA)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BeforeRampup</name>
                  <description>Power up external PA at (RADIO_rampup_start_time - TPWRUPEXTPA)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
