adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <register>
            <name>CONFIG</name>
            <description>Configuration to adjust gain control loop</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x001230C3</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCENABLEGAINSWITCH</name>
                <description>Causes the RF gain to be decreased and the IF gain to be increased if the overall gain can be maintained</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>AGCRFPKDETRESETCOUNT</name>
                <description>The number of clock cycles after the adjustment of gain that the reset signal to the RF peak detector is set high</description>
                <lsb>1</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>AGCWAIT</name>
                <description>The number of clock cycles between each adjustment of the gain while addressMatch is low</description>
                <lsb>5</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>AGCWAITPACKET</name>
                <description>The number of clock cycles between each adjustment of the gain while addressMatch is high</description>
                <lsb>11</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>AGCAAFOVERRIDE</name>
                <description>Override value for aafGain</description>
                <lsb>17</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>AGCMIXOVERRIDE</name>
                <description>Override value for mixGain</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>AGCLNAOVERRIDE</name>
                <description>Override value for lnaGain</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>AGCOVERRIDEGAIN</name>
                <description>0: AGC takes control of all gains, 1: Control all gains (aafGain, mixGain, lnaGain) from registers</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>AGCTOGGLE</name>
                <description>Enable(1) or disable(0) functional testmode for AGC</description>
                <lsb>29</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>AGCENABLEGAINREVERT</name>
                <description>Gain reversion. 0: reduce IF gain before RF gain, 1: reduce RF gain before IF gain.</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CALIBRATION</name>
            <description>Calibrate RSSI and Energy Detect values</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSICAL</name>
                <description>RSSI calibration value</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ED154CAL</name>
                <description>802154 Energy Detect calibration value</description>
                <lsb>7</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Readout latest gain control status</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x0000007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RSSI</name>
                <description>Raw status of received signal strength indicator, directly from RxAgc without buffering</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>AAFGAIN</name>
                <description>Raw AAF gain status</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>MIXGAIN</name>
                <description>Raw mixer gain status</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>LNAGAIN</name>
                <description>Raw LNA gain status</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RFPKDET</name>
                <description>RF peak detector output after sync. Represent state[5:4] in RxAgc.</description>
                <lsb>24</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>IFPKDET</name>
                <description>IF peak detector output. Represent state[3:2] in RxAgc.</description>
                <lsb>26</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>BBPKDET</name>
                <description>BB peak detector output. Represent state[1:0] in RxAgc.</description>
                <lsb>28</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXIF</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RXIF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7E4</addressOffset>
          <register>
            <name>RXPEAKDETECT</name>
            <description>Configuration of IF Rx peak detector</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x040C8384</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HIGHTHRES</name>
                <description>High threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>LOWTHRES</name>
                <description>Low threshold of IF peak detector. This valued is based on the 11-bits ADC of SPHYNX_ANA.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>DECAYSTEP</name>
                <description>Constant output reduction step</description>
                <lsb>24</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>BITCONVERTER</name>
          <description>Configuration of ADC output to digital front-end</description>
          <addressOffset>0x7E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x003FF3FF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FINALCALOFFSETI</name>
              <description>ADC offset compensation of channel I (unsigned)</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>FINALCALOFFSETQ</name>
              <description>ADC offset compensation of channel Q (unsigned)</description>
              <lsb>12</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODESTANDALONE</name>
          <description>Data rate and modulation when SPHYNX in standalone mode</description>
          <addressOffset>0x7F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RADIOMODEINT</name>
              <description>Internal radio mode consists of sSel, zeroIf, deModN and mode[3:0]</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>USERADIOMODEINT</name>
              <description>0: use radioMode/radioModeUpdate from port (controlled from top), 1: use radioMode/radioModeUpdate from registers in this IP</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGRADIOPHY</name>
          <description>Debug for radio PHY</description>
          <addressOffset>0x7FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUFFEREDTXPWR</name>
              <description>Set to high to buffer TXPOWER so that sub-modules in the MMI will only update next tx power config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for Tx test.</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>TIEADCBITOZERO</name>
              <description>0: output normal adcBinaryBI, 1: tie adcBinaryBI to zero</description>
              <lsb>9</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>TIEADCBQTOZERO</name>
              <description>0: output normal adcBinaryBQ, 1: tie adcBinaryBQ to zero</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>CALINVERTCODE</name>
              <description>1: Invert all calibration codes</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>USEMODEDEPENDENTTDELTA</name>
              <description>1: use TDELTAPIPE and TDELTAPWRDNPA from MODEDEPENDENT register instead of TIMINGTX2</description>
              <lsb>13</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMMAND</name>
          <description>Send or receive command directly to the AdPll digital island. Only write to this register when FSASYNCBUSBUSY returns 0</description>
          <addressOffset>0x0800</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ADPLLCOMMAND</name>
              <description>Controls the asynch interface, bits[27:16] are address, bits [15:0] are command/data field</description>
              <lsb>0</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>READ</name>
              <description>When 1, a read transaction is initiated. When the event COMPLETETRANS is set, read back this register</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSFREQFINETUNE</name>
          <description>Allows fine-tuning the RF frequency with a very fine resolution</description>
          <addressOffset>0x0804</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSFREQFINETUNE</name>
              <description>2-complement number for fine-tuning the frequency in steps of 488.28 Hz</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVIATION</name>
          <description>Frequency deviation for modulation</description>
          <addressOffset>0x0808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DEVIATION</name>
              <description>Frequency deviation for modulation</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODRATE</name>
          <description>Select modulation rate</description>
          <addressOffset>0x080C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODRATE</name>
              <description>Select modulation rate</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>250Kbit</name>
                  <description>250 kbps</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500Kbit</name>
                  <description>500 kbps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1Mbit</name>
                  <description>1 Mbps</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2Mbit</name>
                  <description>2 Mbps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4Mbit</name>
                  <description>4 Mbps</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODFILTERING</name>
          <description>Select gaussian filtering mode</description>
          <addressOffset>0x0810</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODFILTERING</name>
              <description>Select gaussian filtering mode</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>None</name>
                  <description>No filtering</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1bt00</name>
                  <description>Gfsk Bt=1.00</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt60</name>
                  <description>Gfsk Bt=0.60</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2bt00</name>
                  <description>Gfsk Bt=2.00</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt40</name>
                  <description>Gfsk Bt=0.40</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt45</name>
                  <description>Gfsk Bt=0.45</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt50</name>
                  <description>Gfsk Bt=0.50</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0bt55</name>
                  <description>Gfsk Bt=0.55</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CUSTOMMODULATION</name>
          <description>Enable reading from memory and passing data over to AdPll</description>
          <addressOffset>0x0814</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable reading from memory and passing data over to AdPll</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Custom modulation disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Custom modulation enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIRCULARDMA</name>
              <description>If set to 1, the END event of the DMA will trigger the START task in order to transmit the same data over and over again (only works if DmaChannelPeripheral is inside AdPllCompanion)</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSCLOCKSELECT</name>
          <description>Set the clock source for the AdPll digital island</description>
          <addressOffset>0x0818</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERNAL</name>
              <description>Set the clock source for the AdPll digital island when fsStart is high</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CORE</name>
              <description>Set the clock source for the AdPll digital island when fsStart is low</description>
              <lsb>2</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>STOP</name>
              <description>Force-stopping the clock internally in the AdPll island</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>OVRVAL</name>
              <description>Used instead of 'fsStart' if FSCLOCKSELECT.OVREN is set</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVREN</name>
              <description>Override enable for setting the clock switch. If 0, fsStart decides which clock to use. If 1, FSCLOCKSELECT.OVRVAL selects which clock to use</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUNITRIGCALVAL</name>
          <description>Read the calibrated value for the universal trigger</description>
          <addressOffset>0x081C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSUNITRIGCALVAL</name>
              <description>Read the calibrated value for the universal trigger</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUNITRIGMANUAL</name>
          <description>Manual control of the uni trigger signals. Note that fsUniTriggerCalWord is controlled by writing to the separate register FSUNITRIGCALVAL</description>
          <addressOffset>0x0820</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLEMANUAL</name>
              <description>Enable manual control</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>FSUNITRIGGER</name>
              <description>The fsUniTrigger signal when using manual control</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>FSUNITRIGGERCALEN</name>
              <description>The fsUniTriggerCalEn signal when using manual control</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>FSUNITRIGGERSRC</name>
              <description>The fsUniTriggerCalSrc signal when using manual control</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSUNITRIGCALOUT</name>
          <description>Read the signal directly from fsUniTriggerCalOut</description>
          <addressOffset>0x0824</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSUNITRIGCALOUT</name>
              <description>Read the raw fsUniTriggerCalOut value</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSASYNCBUSCONF</name>
          <description>Some special settings for the asynchronous bus configuration</description>
          <addressOffset>0x0828</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CHECKSTATUS</name>
              <description>When 1, every write transaction uses 8 x 32 MHz clock cycles instead of 4 x 32 MHz clock cycles. Confirmation is received whether the transaction was actually received by AdPll.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>DISABLEAUTOSETTING</name>
              <description>Do not send settings at the beginning to AdPll</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>CHECKSTATUSAUTO</name>
              <description>When 1, check the first transaction during sending auto. If errorenous stop the state machine</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>IGNORECLOCKSTARTED</name>
              <description>The bus scheduler will not wait for AdPll to say clockStarted</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
