adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>ADPLLSTARTUPCOMMAND4</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND5</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08C4</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND6</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08C8</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND7</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONINTEN</name>
          <description>Unspecified</description>
          <addressOffset>0x08DC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS</name>
              <description>Interrupt enable register for events (unused since IRQ not connected)</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONINTENSET</name>
          <description>Unspecified</description>
          <addressOffset>0x08E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToSet</modifiedWriteValues>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS</name>
              <description>Interrupt set register for events (unused since IRQ not connected)</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONINTENCLR</name>
          <description>Unspecified</description>
          <addressOffset>0x08E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS</name>
              <description>Interrupt clear register for events (unused since IRQ not connected)</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONINTPEND</name>
          <description>Unspecified</description>
          <addressOffset>0x08E8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS</name>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODECONF</name>
          <description>Mode specific configuration regiser</description>
          <addressOffset>0x900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010203</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SATDLYCHAN</name>
              <description>Mode dependent saturation delay for different modes</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>SATDLYDEC</name>
              <description>Mode dependent saturation delay in decimation filters for different modes</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>HIGHIFMODE</name>
              <description>Selects mixing frequency. Setting this register to 0 halves the mixing frequency.</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FESTATUS</name>
          <description>Frontend readout register</description>
          <addressOffset>0x904</addressOffset>
          <access>read-only</access>
          <resetValue>0x00001010</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CALPHI</name>
              <description>calPhi from IQCal</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>CALAMP</name>
              <description>calAmp from IQCal</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>CALFIN</name>
              <description>High when IQCal search finished</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MAGNITUDE</name>
              <description>Magnitude output from BB peak detector</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FECONFIG</name>
          <description>Config register</description>
          <addressOffset>0x908</addressOffset>
          <access>read-write</access>
          <resetValue>0x10800005</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Alpha for IIR filter used in logMag calculation</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>SCALERDECAY</name>
              <description>The number of clock cycles to wait before stepping down the internal memory for the scaling. The value 0 means that the decay feature is off.</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>SCALECONST</name>
              <description>A constant scaling that overrides dynamic scaling behaviour in the IQ Scaler. Value != 0 enables constant scaling.</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>SCALERMODE</name>
              <description>Mode for narrow scaling output.</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Classic log based scaling mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>LUT based scaling mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCALERWRAPPROTEN</name>
              <description>Wraparound protection in IQ Scaler.</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable wraparound protection. Not recommended to disable with constant scaling.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Disable wraparound protection. Scaled input is set to max or min instead of wrapping around.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDISABLE</name>
              <description>Disable Q samples to save power</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>INVERTI</name>
              <description>Invert I channel in case Q channel leads I</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>SELINPUTMIX</name>
              <description>Mixer Input Select between Decimator's Output and Injection DMA, i.e., SELINPUTMIX = 0 for Decimator; SELINPUTMIX = 1 for Injection DMA</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>SELINPUTCHAN</name>
              <description>Channel Filters Input Select between Mixer and Injection DMA, i.e., SELINPUTCHAN = 0 for Mixer; SELINPUTCHAN = 1 for Injection DMA</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IQCALCONF</name>
          <description>Gain and phase mismatch calibration control for I and Q</description>
          <addressOffset>0x90C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00101028</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IQCALWAIT</name>
              <description>Settling time (in number of 16 MHz clock periods) for rssi input to stabilize</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>CALAMP</name>
              <description>Stored calAmp value</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>CALPHI</name>
              <description>Stored calPhi value</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>CALPHISIGN</name>
              <description>Sign of calPhi value</description>
              <lsb>27</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>MODE</name>
              <description>IQCal search mode</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Optimized</name>
                  <description>Optimized search algorithm.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Exhaustive</name>
                  <description>Exhaustive search.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Cancellation</name>
                  <description>Optimized search with cancellation.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RUN</name>
              <description>Run I and Q calibration procedure</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Stored</name>
                  <description>Using stored values for calPhi and calAmp</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Calib</name>
                  <description>Running calibration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BBPKDETCONF</name>
          <description>Configuration for baseband peak detector</description>
          <addressOffset>0x910</addressOffset>
          <access>read-write</access>
          <resetValue>0x030140C8</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HIGHTHRES</name>
              <description>High threshold for peak detector</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>LOWTHRESH</name>
              <description>Low threshold for peak detector</description>
              <lsb>12</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DECAYSTEP</name>
              <description>Constant output reduction step</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>DECFILTERS</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_DECFILTERS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x914</addressOffset>
          <cluster>
            <name>OUTMAIN</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_DECFILTERS_OUTMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the output outMain</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DECFIR0</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_DECFILTERS_DECFIR0</headerStructName>
            <access>read-write</access>
            <addressOffset>0x004</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000007</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CONTROL</name>
              <description>Control register for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAPSEL</name>
                  <description>Tap-select: number of active taps minus 2</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS0</name>
              <description>Coefficient register 0 for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF0</name>
                  <description>Signed filter coefficient 0</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
              </fields>
            </register>
