adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
            <register>
              <name>COEFFS1</name>
              <description>Coefficient register 1 for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000006</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF1</name>
                  <description>Signed filter coefficient 1</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS2</name>
              <description>Coefficient register 2 for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000006</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF2</name>
                  <description>Signed filter coefficient 2</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS3</name>
              <description>Coefficient register 3 for the PUnit decFIR0 of type IP_FIR</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF3</name>
                  <description>Signed filter coefficient 3</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DECFIR1</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_DECFILTERS_DECFIR1</headerStructName>
            <access>read-write</access>
            <addressOffset>0x01C</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CONTROL</name>
              <description>Control register for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAPSEL</name>
                  <description>Tap-select: number of active taps minus 2</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS0</name>
              <description>Coefficient register 0 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000008</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF0</name>
                  <description>Signed filter coefficient 0</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS1</name>
              <description>Coefficient register 1 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF1</name>
                  <description>Signed filter coefficient 1</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS2</name>
              <description>Coefficient register 2 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000018</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF2</name>
                  <description>Signed filter coefficient 2</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS3</name>
              <description>Coefficient register 3 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF3</name>
                  <description>Signed filter coefficient 3</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS4</name>
              <description>Coefficient register 4 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF4</name>
                  <description>Signed filter coefficient 4</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS5</name>
              <description>Coefficient register 5 for the PUnit decFIR1 of type IP_FIR</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF5</name>
                  <description>Signed filter coefficient 5</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DECFIR2</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_DECFILTERS_DECFIR2</headerStructName>
            <access>read-write</access>
            <addressOffset>0x03C</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000001</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CONTROL</name>
              <description>Control register for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAPSEL</name>
                  <description>Tap-select: number of active taps minus 2</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS0</name>
              <description>Coefficient register 0 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000008</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF0</name>
                  <description>Signed filter coefficient 0</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS1</name>
              <description>Coefficient register 1 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF1</name>
                  <description>Signed filter coefficient 1</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS2</name>
              <description>Coefficient register 2 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000018</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF2</name>
                  <description>Signed filter coefficient 2</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS3</name>
              <description>Coefficient register 3 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF3</name>
                  <description>Signed filter coefficient 3</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS4</name>
              <description>Coefficient register 4 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF4</name>
                  <description>Signed filter coefficient 4</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS5</name>
              <description>Coefficient register 5 for the PUnit decFIR2 of type IP_FIR</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF5</name>
                  <description>Signed filter coefficient 5</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>CHANNELFILTERS</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_CHANNELFILTERS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x970</addressOffset>
          <cluster>
            <name>OUTMAIN</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_OUTMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the output outMain</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SOURCE</name>
              <description>Source select register for the output outMain</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SOURCE</name>
                  <description>Data source select</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SrcInMain</name>
                      <description>SRC_INMAIN (NOT LEGAL)</description>
                      <value>0xF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR0</name>
                      <description>SRC_IIR0 (NOT LEGAL)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR1</name>
                      <description>SRC_IIR1 (NOT LEGAL)</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR0</name>
                      <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR1</name>
                      <description>SRC_NOTCHIIR1</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcDecFIR</name>
                      <description>SRC_DECFIR</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
