adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
            <register>
              <name>STATUS</name>
              <description>Status register for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IQSATURATION</name>
                  <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB0</name>
              <description>Coefficient register B0 for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x000003C0</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB0</name>
                  <description>Signed filter coefficient B0</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB1</name>
              <description>Coefficient register B1 for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000AB0</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB1</name>
                  <description>Signed filter coefficient B1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB2</name>
              <description>Coefficient register B2 for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x000003C0</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB2</name>
                  <description>Signed filter coefficient B2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA1</name>
              <description>Coefficient register A1 for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000AB0</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA1</name>
                  <description>Signed filter coefficient A1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA2</name>
              <description>Coefficient register A2 for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000380</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA2</name>
                  <description>Signed filter coefficient A2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>NOTCHIIR1</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_NOTCHIIR1</headerStructName>
            <access>read-write</access>
            <addressOffset>0x068</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000007</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IQSATURATION</name>
                  <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB0</name>
              <description>Coefficient register B0 for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB0</name>
                  <description>Signed filter coefficient B0</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB1</name>
              <description>Coefficient register B1 for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB1</name>
                  <description>Signed filter coefficient B1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB2</name>
              <description>Coefficient register B2 for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB2</name>
                  <description>Signed filter coefficient B2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA1</name>
              <description>Coefficient register A1 for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA1</name>
                  <description>Signed filter coefficient A1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA2</name>
              <description>Coefficient register A2 for the PUnit notchIIR1 of type IP_IIR2</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA2</name>
                  <description>Signed filter coefficient A2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>DECFIR</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_DECFIR</headerStructName>
            <access>read-write</access>
            <addressOffset>0x084</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000007</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SOURCE</name>
              <description>Source select register for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000003</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SOURCE</name>
                  <description>Data source select</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SrcInMain</name>
                      <description>SRC_INMAIN (NOT LEGAL)</description>
                      <value>0xF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR0</name>
                      <description>SRC_IIR0 (NOT LEGAL)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR1</name>
                      <description>SRC_IIR1</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR0</name>
                      <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR1</name>
                      <description>SRC_NOTCHIIR1</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcDecFIR</name>
                      <description>SRC_DECFIR (NOT LEGAL)</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CONTROL</name>
              <description>Control register for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000004</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TAPSEL</name>
                  <description>Tap-select: number of active taps minus 2</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS0</name>
              <description>Coefficient register 0 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000008</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF0</name>
                  <description>Signed filter coefficient 0</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS1</name>
              <description>Coefficient register 1 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF1</name>
                  <description>Signed filter coefficient 1</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS2</name>
              <description>Coefficient register 2 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000018</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF2</name>
                  <description>Signed filter coefficient 2</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS3</name>
              <description>Coefficient register 3 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000010</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF3</name>
                  <description>Signed filter coefficient 3</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS4</name>
              <description>Coefficient register 4 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF4</name>
                  <description>Signed filter coefficient 4</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFS5</name>
              <description>Coefficient register 5 for the PUnit decFIR of type IP_FIR</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFF5</name>
                  <description>Signed filter coefficient 5</description>
                  <lsb>0</lsb>
                  <msb>5</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>CFO_STAT</name>
          <description>Carrier freq. offset estimate</description>
          <addressOffset>0xB00</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Readout of last valid decision level set in BitSlicer (signed)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>LASTDEMODACTIVE</name>
              <description>0: Standard mode was used last 1: Hypermode was last used</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>PHASE</name>
              <description>Readout of last valid phase set in correlator (hypermode only) (signed)</description>
              <lsb>16</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PBTEST</name>
          <description>Test: PB calibration</description>
          <addressOffset>0xB04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000880</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PBIBPSTRIM</name>
              <description>Trim code for IBPS currents</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VBGTRIM</name>
              <description>Trim code for VBG to FS_VCOREG</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRENPBIBPSTRIM</name>
              <description>if '1' enable override for PBIBPSTRIM</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>OVRENVBGTRIM</name>
              <description>if '1' enable override for VBGTRIM</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCCOEFFS</name>
          <description>Test and Debug: DBC coefficients override</description>
          <addressOffset>0xB08</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PADDRUPDATEOVREN</name>
              <description>paddrUpdateOvrEn</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>PADDRUPDATEOVRVAL</name>
              <description>paddrUpdateOvrVal</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVRALWAYSUPDATE</name>
              <description>Zero means coefficients only updated when needed (default), set to 1 coefficients are always updated when the radio is enabled.</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
