adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>QOVERRIDE4</name>
          <description>Trim value override register 4 for nRF52</description>
          <addressOffset>0xB0C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00140000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBFILTTH</name>
              <description>Threshold for the preamble filter</description>
              <lsb>16</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>ENPREAMBFILT</name>
              <description>Enable preamble filter</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE5</name>
          <description>Trim value override register 5 for nRF52</description>
          <addressOffset>0xB10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00060020</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREAMBFILTCYCLES</name>
              <description>Override value for preambFiltCycles</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTH</name>
              <description>Override value for bitSlicerSwingTh</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREAMBFILTMINSTRLEN</name>
              <description>Override value for preambFiltMinStrLen</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE6</name>
          <description>Trim value override register 6 for nRF52</description>
          <addressOffset>0xB14</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBCENABLESRC</name>
              <description>Override value for dbcEnableSrc</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AlwaysOn</name>
                  <description>Always on when not address match</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BBLogMag</name>
                  <description>When bbLogMag is above a threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BitSlicerSwing</name>
                  <description>When a certain time has gone since the input to the bitslicer was above BITSLICERSWINGTH</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Both</name>
                  <description>Both BBLogMag and BitSlicerSwing</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBCTIMEOUT</name>
              <description>Override value for correlator timeout,in bit periods (hypermode)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>DBCENABLETH</name>
              <description>Override value for correlator enable threshold</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>ENCHECKMULTIPEAKS</name>
              <description>Enable checking of several correlator peaks in hypermode</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>DBCCORRTHEN</name>
              <description>Override value enable for DBCCORRTH and MFBSTRBOFFSET</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE9</name>
          <description>Trim value override register 9 for nRF52</description>
          <addressOffset>0xB18</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000053</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PSDDEMODDELAY</name>
              <description>Override value for psdDemodDelay (standard mode)</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DEMODINVERT</name>
              <description>Override value for demodInvert (standard and hyper)</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>DELAYBITOUTSTDDEMOD</name>
              <description>Override value for delayBitOutStdDemod (standard mode)</description>
              <lsb>4</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>BITSLICERSWINGTIME</name>
              <description>Bit slicer swing time</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>SCALERDECAYDELAY</name>
              <description>Decay delay for the IQ scaler</description>
              <lsb>20</lsb>
              <msb>25</msb>
            </field>
            <field>
              <name>SCALERMODE</name>
              <description>Scaler mode. Set to 1 for LUT based scaling</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE12</name>
          <description>Trim value override register 12 for nRF52</description>
          <addressOffset>0xB24</addressOffset>
          <access>read-write</access>
          <resetValue>0x01F4044C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IFPKDETHIGHTHRES</name>
              <description>Override value for IfpkDetHighThres</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SATDELAYCORRECTION</name>
              <description>Signed correction value for how much the saturation information is delayed from the input ADC samples to the samples being stored to RAM in direction finding operation</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>IFPKDETLOWTHRES</name>
              <description>Override value for IfpkDetLowThres</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE23</name>
          <description>Trim value override register 23 for nRF52</description>
          <addressOffset>0xB28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OVRENCNRIPPLEWARNCFG</name>
              <description>Override enable for CNPEAKMINTHR and CNABSMAXTHR in the CNRIPPLEWARNCFG register</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DISABLEDRIFT</name>
              <description>Disable option for RxDrift.</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>HIGHERTHANMARGINDBC</name>
              <description>Required peak height required for a double correlator peak to be considered higher than previous ones. The register value will be multiplied by 25 to obtain the actual margin. The bitfield is NOT subject to the enable override at bit position 31, and will always be enabled for hypermode.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>KEEPSTDINDSSS</name>
              <description>Keep standard demod in DSSS mode</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>DISABLESYMBOLTRACK</name>
              <description>Disable symbol tracking for IEEE 802.15.4 and BLE LR 125K modes</description>
              <lsb>17</lsb>
              <msb>17</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LELRMISC</name>
          <description>Miscellaneous Controls for Long Range</description>
          <addressOffset>0xB2C</addressOffset>
          <access>read-write</access>
          <resetValue>0x58780114</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LRFRAMERRTRSH</name>
              <description>Framer Receive Threshold</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VITERBIUSESTATEZERO</name>
              <description>Use Viterbi state zero when flushing out bits for BLE LR</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>KEEPMFBONINBLELR125</name>
              <description>Do not stop the clock to RxMFB in BLE LR 125 mode</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>KEEPDESPREADONINBLELR500</name>
              <description>Do not stop the clock to the Despreader in BLE LR 500 mode</description>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>DISABLEFRAMESYNCLRTIMEOUT</name>
              <description>Disable framesync timeout (early address match timeout) for BLE LR mode (hypermode).</description>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LELROFFADDRCHECK</name>
              <description>The number of chip periods earlier which it is allowed to declare frameSync in DecodeLELong</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>CODEPOLY0</name>
              <description>Code Polynom 0</description>
              <lsb>16</lsb>
              <msb>22</msb>
            </field>
            <field>
              <name>CODEPOLY1</name>
              <description>Code Polynom 1</description>
              <lsb>24</lsb>
              <msb>30</msb>
            </field>
            <field>
              <name>LRDESPREADSWAP</name>
              <description>Swap de-spreader</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE25</name>
          <description>TODO</description>
          <addressOffset>0xB30</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DBCCORRTHSTRICT</name>
              <description>Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DBCCORRTHPREVREQUIR</name>
              <description>Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT.</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>MINPEAKCOUNTSTRICT</name>
              <description>Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx.</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>DBCPEAKDETSEL</name>
              <description>DBC peak detector selection</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>Use classic peak detector (backward compatible behavior)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Differential</name>
                  <description>Use differential peak detector</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVRENDBCCORRTHSTRICT</name>
              <description>Override enable for DBCCORRTHSTRICT</description>
              <lsb>28</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>OVRENDBCCORRTHPREVREQUIR</name>
              <description>Override enable for DBCCORRTHPREVREQUIR</description>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
            <field>
              <name>OVRENMINPEAKCOUNTSTRICT</name>
              <description>Override enable for MINPEAKCOUNTSTRICT</description>
              <lsb>30</lsb>
              <msb>30</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCPEAKDETTHR</name>
          <description>Thresholds for each peak detector instance</description>
          <addressOffset>0xB34</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C0C0C0C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>THR0</name>
              <description>Diff threshold 0</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>THR1</name>
              <description>Diff threshold 1</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>THR2</name>
              <description>Diff threshold 2</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>THR3</name>
              <description>Diff threshold 3</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BITSLICERSTAT</name>
          <description>Payload status</description>
          <addressOffset>0xB38</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SUMMIN</name>
              <description>Number of received zeros</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>SUMMAX</name>
              <description>Number of received ones</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BBCTRL</name>
          <description>Miscellaneous mode bits</description>
          <addressOffset>0xB3C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001114</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLELONGRANGE</name>
              <description>Enable long range mode (enabling both 15.4 and long range is not legal)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>BLELONGRANGE_NO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>BLELONGRANGE_YES</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEEE802154</name>
              <description>Enable 15.4 mode (enabling both 15.4 and long range is not legal)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>IEEE802154_NO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>IEEE802154_YES</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPERMODE</name>
              <description>Enable Hyper demodulator</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>HYPERMODE_NO</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>HYPERMODE_YES</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMODFILTMODE</name>
              <description>Decimation mode in PantherDemodFilt</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Decimation mode 2M</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Decimation mode 1M</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250K</name>
                  <description>Decimation mode 250K</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODINDEX</name>
              <description>Modulation index for RxDBCCoeffGen and RxMFB</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0h25</name>
                  <description>Modulation index h=0.25</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0h32</name>
                  <description>Modulation index h=0.32</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0h5</name>
                  <description>Modulation index h=0.5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1h0</name>
                  <description>Modulation index h=1.0</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2h0</name>
                  <description>Modulation index h=2.0</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEAADEMOD</name>
              <description>Enable buffering, decoding and address matching of first 16 bits of Access Address</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>First 16 bits of AA only qualified by DBC</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>First 16 bits of AA qualified by both DBC and MFB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCCORR</name>
          <description>Thresholds for the double correlator</description>
          <addressOffset>0xB40</addressOffset>
          <access>read-write</access>
          <resetValue>0x1FFFFF90</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TH</name>
              <description>Correlation threshold for double correlator in normal operation</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STRICT</name>
              <description>Correlation threshold for double correlator used in BleLr mode to resync to another preamble while already working on a previous preamble. Also applies for Ieee 802.15.4 mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PREVREQUIR</name>
              <description>Correlation threshold for double correlator used in BleLr mode to reject a later resync using DBCCORRTHSTRICT. Also applies for Ieee 802.15.4 mode</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>ADDRTIMEOUT</name>
              <description>Override value for address match timeout, [in bit periods] (hypermode). 0 means no timeout. If BALEN is 3, the actual value of DBCADDRTIMEOUT will be the value written to this register minus 8.</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
