adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>BSCONFIG</name>
          <description>Bitslicer configuration</description>
          <addressOffset>0xB44</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000205A</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BITLENGTHTOLERANSE</name>
              <description>Override for bsBitLengthToleranse</description>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>DISABLEPREAMBLEBLOCK</name>
              <description>Override for bsDisablePreambleBlock</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>ENABLETHRESHOLDADJUST</name>
              <description>Override for bsEnableThresholdAdjust</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>DATAPEAK2PEAK</name>
              <description>Override for bsDataPeak2Peak</description>
              <lsb>4</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>STROBEDATAIN</name>
              <description>Override for bsStrobeDataIn</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>STROBEDELAY</name>
              <description>Override for bsStrobeDelay</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>YLEVALG</name>
              <description>Override for bsYlevAlg</description>
              <lsb>15</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MFB</name>
          <description>Matched Filter Bank (MFB) configuration</description>
          <addressOffset>0xB48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00001C03</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STRBOFFSET</name>
              <description>Override value for strobe offset</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BYPASSMAJVOTE</name>
              <description>Bypass majority vote</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pass</name>
                  <description>Majority vote</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypass</name>
                  <description>Bypass through majority vote</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOFTBITMODE</name>
              <description>Method used for the softbit calulation</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Max</name>
                  <description>Softbit calculation in MFB uses the maximum</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sum</name>
                  <description>Softbit calculation in MFB uses the sum</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WSum1</name>
                  <description>Softbit calculation in MFB uses the weighted sum 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WSum2</name>
                  <description>Softbit calculation in MFB uses the weighted sum 2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USEMJ</name>
              <description>Use hard bit from majority vote as the output of the RxMFB. Use hard bit from soft bit generator otherwise.</description>
              <lsb>10</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>USEMJFB</name>
              <description>Use hard bit from majority vote as the feedback inside the RxMFB. Use hard bit from soft bit generator otherwise.</description>
              <lsb>11</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ENABLEFEEDBACK</name>
              <description>Enable decision feedback for matched filter bank</description>
              <lsb>12</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CN</name>
          <description>Configuration for the CNRIPPLEWARN functionality used for BLE LR. Configuration is only enabled when OVRENCNRIPPLEWARNCFG in OVERRIDE23 is set</description>
          <addressOffset>0xB4C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PEAKMINTHR</name>
              <description>Required peak height compared to baseline level measured just before the peak at the double correlator output. If the peak height is below the threshold, it will be ignored. This feature is disabled when CNPEAKMINTHR is set to 0x0000.</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ABSMAXTHR</name>
              <description>maximum baseline value before the peak at the double correlator output. if the baseline value is above the threshold, the following peak will be ignored. this value is ignored when CNABSMAXTHR is set to 0x0000.</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PEAK</name>
          <description>Peak detector configuration</description>
          <addressOffset>0xB50</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENMAYBESIDELOBE</name>
              <description>Ignore peaks from DBC which look like sidelobes</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ENADUALDISTANCE</name>
              <description>Allow dual distance between peaks</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>BBCKSEL</name>
          <description>Clock rates</description>
          <addressOffset>0xB54</addressOffset>
          <access>read-write</access>
          <resetValue>0x00772222</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STDDEMODDIVA</name>
              <description>Standard demod clock divider A</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32M</name>
                  <description>Clock 32MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>Clock 16MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Clock 8MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STDDEMODDIVB</name>
              <description>Standard demod clock divider B</description>
              <lsb>4</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32M</name>
                  <description>Clock 32MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>Clock 16MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Clock 8MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPDEMODDIVA</name>
              <description>Hyper demod clock divider A</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32M</name>
                  <description>Clock 32MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>Clock 16MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Clock 8MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPDEMODDIVB</name>
              <description>Hyper demod clock divider B</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>32M</name>
                  <description>Clock 32MHz</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16M</name>
                  <description>Clock 16MHz</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Clock 8MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPDEMODDIVC</name>
              <description>Hyper demod clock divider C (max 8MHz)</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8M</name>
                  <description>Clock 8MHz</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYPDEMODDIVD</name>
              <description>Hyper demod clock divider D (max 4MHz)</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4M</name>
                  <description>Clock 4MHz</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2M</name>
                  <description>Clock 2MHz</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1M</name>
                  <description>Clock 1MHz</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500K</name>
                  <description>Clock 500kHz</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock OFF</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCORRADAP</name>
          <description>Adaptive thresholds for double correlator.</description>
          <addressOffset>0xB58</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000037D</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TH</name>
              <description>A ratio to update the DBC ratio threshold when adaptive threshold is enabled and a strong peak is found. Fraction of highest correlator match historically seen. Setting of 0.90625 is default.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>DE</name>
              <description>A ratio to decay the DBC ration threshold when using adaptive threshold and a weak peak is found.</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>OFFS</name>
              <description>Offset for comparing between current and historical DBC magnitude</description>
              <lsb>10</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MNSTORED</name>
          <description>Stored value of Cn and Pn from the double correlator at the last detect</description>
          <addressOffset>0xB5C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNMIDSQUARED</name>
              <description>Squared value of Cn which can be used to find Mn associated with the last double correlator detect</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PNMIDSQUARED</name>
              <description>Squared value of Pn which can be used to find Mn associated with the last double correlator detect</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEARLYLATE</name>
          <description>The Cn value associated with the clock cycle before and after the actually double correlator peak was found (detect)</description>
          <addressOffset>0xB60</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CNEARLYSQUARED</name>
              <description>Squared value of Cn before the peak</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>CNLATESQUARED</name>
              <description>Squared value of Cn after the peak</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MFBSTTCNFG</name>
          <description>Matched Filter Bank (MFB) symbol time tracking configuration</description>
          <addressOffset>0xB64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00C87D5A</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STTERRORTH</name>
              <description>Strobe time tracking: strobe time error threshold</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STTTIMEOUT</name>
              <description>Period in bits where it is not allowed to set incStrb or decStrb</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>PAYLOADSIZE</name>
              <description>Minumum payload size for when STT is enabled</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>STTEN</name>
              <description>Enable for symbol time tracking logic in RxMFB.</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RXAA</name>
          <description>32-bit Hyper Access Address as decoded; for 1M, 2M and 4M BLE and proprietary modes</description>
          <addressOffset>0xB68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <modifiedWriteValues>zeroToClear</modifiedWriteValues>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>STTCNFG_LR</name>
          <description>Strobe time tracking configuration in long range mode</description>
          <addressOffset>0xB70</addressOffset>
          <access>read-write</access>
          <resetValue>0x000010FA</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STTERRORTHLR</name>
              <description>Strobe time tracking error threshold in BLE LR mode</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STTTIMEOUTLR</name>
              <description>Strobe time tracking timeout in BLE LR mode</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
