adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <register>
          <name>DFEMODE</name>
          <description>Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD)</description>
          <addressOffset>0xD00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DFEOPMODE</name>
              <description>Direction finding operation mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Direction finding mode disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoD</name>
                  <description>Direction finding mode set to AoD</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AoA</name>
                  <description>Direction finding mode set to AoA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFESTATUS</name>
          <description>DFE status information</description>
          <addressOffset>0xD04</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWITCHINGSTATE</name>
              <description>Internal state of switching state machine</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Switching state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Offset</name>
                  <description>Switching state Offset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Guard</name>
                  <description>Switching state Guard</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ref</name>
                  <description>Switching state Ref</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Switching</name>
                  <description>Switching state Switching</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ending</name>
                  <description>Switching state Ending</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLINGSTATE</name>
              <description>Internal state of sampling state machine</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Idle</name>
                  <description>Sampling state Idle</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Sampling</name>
                  <description>Sampling state Sampling</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL1</name>
          <description>Various configuration for Direction finding</description>
          <addressOffset>0xD10</addressOffset>
          <access>read-write</access>
          <resetValue>0x00023282</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>NUMBEROF8US</name>
              <description>Length of the AoA/AoD procedure in number of 8 us units</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DFEINEXTENSION</name>
              <description>Add CTE extension and do antenna switching/sampling in this extension</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>AoA/AoD procedure triggered at end of CRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Payload</name>
                  <description>Antenna switching/sampling is done in the packet payload</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSWITCHSPACING</name>
              <description>Interval between every time the antenna is changed in the SWITCHING state</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERWITHTASKONLY</name>
              <description>Trigger AoA/AoD procedure using only task</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OnlyTask</name>
                  <description>Only allow triggering a procedure with TASKS_DFESTART</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Multiple</name>
                  <description>Trigger also with other signals</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACINGREF</name>
              <description>Interval between samples in the REFERENCE period</description>
              <lsb>12</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPLETYPE</name>
              <description>Whether to sample I/Q or magnitude/phase</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IQ</name>
                  <description>Complex samples in I and Q</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MagPhase</name>
                  <description>Complex samples as magnitude and phase</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSAMPLESPACING</name>
              <description>Interval between samples in the SWITCHING period when CTEINLINECTRLEN is 0</description>
              <lsb>16</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPEATPATTERN</name>
              <description>Repeat every antenna pattern N times.</description>
              <lsb>20</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoRepeat</name>
                  <description>Do not repeat (1 time in total)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGCBACKOFFGAIN</name>
              <description>Gain will be lowered by the specified number of gain steps at the start of CTE</description>
              <lsb>24</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL2</name>
          <description>Start offset for Direction finding</description>
          <addressOffset>0xD14</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TSWITCHOFFSET</name>
              <description>Signed value offset after the end of the CRC before starting switching in number of 16M cycles</description>
              <lsb>0</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>TSAMPLEOFFSET</name>
              <description>Signed value offset before starting sampling in number of 16M cycles relative to the beginning of the REFERENCE state - 12 us after switching start</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DFECTRL3</name>
          <description>Various hacker/tuning configuration for Direction finding</description>
          <addressOffset>0xD18</addressOffset>
          <access>read-write</access>
          <resetValue>0x28433000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPACINGBETWEEN</name>
              <description>Signed tuning value for the spacing between the last sample in the reference period and the first sample in the first sample slot</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>SPACINGBETWEEN2US</name>
              <description>Same as SPACINGBETWEEN when using CTEINLINECTRL and CTEType is 2 us slots</description>
              <lsb>6</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>COMP4USSWITCHING</name>
              <description>Number of 4us periods to subtract from numberOf8us when calculating total number of antenna slots switches</description>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>COMP4USSAMPLING</name>
              <description>Number of 4us periods to subtract from numberOf8us when calculating total number of samples to capture</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>TGUARDPERIOD</name>
              <description>Length of GUARD period in number of microseconds, normally 4</description>
              <lsb>20</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>TREFPERIOD</name>
              <description>Length of REFERENCE period in number of microseconds, normally 8</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>CHANGESAMPLERATE</name>
              <description>Whether to have the ability to have separate sampling rate in the REFERENCE period vs the SWITCHING state</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Same</name>
                  <description>Always use sample spacing given by TSAMPLESPACINGREF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Change</name>
                  <description>Use TSAMPLESPACINGREF in the REFERENCE period, and TSAMPLESPACING or CTEINLINEAODRXMODExUS in the SWITCHING period</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIRRORSEQUENCE</name>
              <description>When reaching the last antenna pattern, it repeats that pattern, and then goes back down again.</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Do not mirror the sequence</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Mirror the sequence</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHORTENMIRRORSEQUENCE</name>
              <description>Applies only when MIRRORSEQUENCE is set. Selects whether to repeat the end pattern (in both ends) or not</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>End patterns are repeated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>End patterns are not repeated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
