adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <register>
            <name>DACNF</name>
            <description>Device address match configuration</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENA0</name>
                <description>Enable or disable device address matching using device address 0</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA1</name>
                <description>Enable or disable device address matching using device address 1</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA2</name>
                <description>Enable or disable device address matching using device address 2</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA3</name>
                <description>Enable or disable device address matching using device address 3</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA4</name>
                <description>Enable or disable device address matching using device address 4</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA5</name>
                <description>Enable or disable device address matching using device address 5</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA6</name>
                <description>Enable or disable device address matching using device address 6</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENA7</name>
                <description>Enable or disable device address matching using device address 7</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXADD0</name>
                <description>TxAdd for device address 0</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>TXADD1</name>
                <description>TxAdd for device address 1</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>TXADD2</name>
                <description>TxAdd for device address 2</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>TXADD3</name>
                <description>TxAdd for device address 3</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>TXADD4</name>
                <description>TxAdd for device address 4</description>
                <lsb>12</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>TXADD5</name>
                <description>TxAdd for device address 5</description>
                <lsb>13</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>TXADD6</name>
                <description>TxAdd for device address 6</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>TXADD7</name>
                <description>TxAdd for device address 7</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>BCC</name>
            <description>Bit counter compare</description>
            <addressOffset>0x094</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BCC</name>
                <description>Bit counter compare</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AACHKOVERRIDE</name>
            <description>Address Check Override</description>
            <addressOffset>0x098</addressOffset>
            <access>read-write</access>
            <resetValue>0x02600000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENDCOUNTHYPSTD</name>
                <description>Defines maximum number of PDU bits to compare between Hyper and Std demodulator</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable AA bit 15 check</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AA16to31</name>
                    <description>Enable AA16..31</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA15to31</name>
                    <description>Enable AA15..31</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA14to31</name>
                    <description>Enable AA14..31</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA13to31</name>
                    <description>Enable AA13..31</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA12to31</name>
                    <description>Enable AA12..31</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA11to31</name>
                    <description>Enable AA11..31</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA10to31</name>
                    <description>Enable AA10..31</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA9to31</name>
                    <description>Enable AA9..31</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA8to31</name>
                    <description>Enable AA8..31 (when 32-bit AA is enabled)</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA7to31</name>
                    <description>Enable AA7..31 (when 32-bit AA is enabled)</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA6to31</name>
                    <description>Enable AA6..31 (when 32-bit AA is enabled)</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA5to31</name>
                    <description>Enable AA5..31 (when 32-bit AA is enabled)</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA4to31</name>
                    <description>Enable AA4..31 (when 32-bit AA is enabled)</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA3to31</name>
                    <description>Enable AA3..31 (when 32-bit AA is enabled)</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA2to31</name>
                    <description>Enable AA2..31 (when 32-bit AA is enabled)</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AA1to31</name>
                    <description>Enable AA1..31 (when 32-bit AA is enabled)</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DISABLE</name>
                <description>Disable std AA checker</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable std AA checker</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable std AA checker</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ALLOWADDRMATCHEARLY</name>
                <description>Enable ignore std AA checker before shift register filled</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERFECTADDRWINDOW</name>
                <description>Enable timing accurate address match window in demodulator</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>The address window has some margin</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>The address window spans only one bit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SFDMATCHENABLE</name>
                <description>Enable every 4 bits SFD match for IEEE 802.15.4</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SYMSBEFORESFD</name>
                <description>Number of preamble symbols before SFD to match, by default 2 symbols.</description>
                <lsb>24</lsb>
                <msb>26</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKETCNTR1</name>
            <description>Unspecified</description>
            <addressOffset>0x09C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>Packet counter value</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKETCNTR2</name>
            <description>Unspecified</description>
            <addressOffset>0x0A0</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HYPER</name>
                <description>Number of detected correlator syncs</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>NORMAL</name>
                <description>Packet counter value (number of packets with addressmatch ok)</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTESTATUS</name>
            <description>CTEInfo parsed from received packet</description>
            <addressOffset>0x0A4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTETIME</name>
                <description>CTETime parsed from packet</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>RFU</name>
                <description>RFU parsed from packet</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>CTETYPE</name>
                <description>CTEType parsed from packet</description>
                <lsb>6</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HYPSTDCHECKSTAT</name>
            <description>Address Check Override</description>
            <addressOffset>0x0A8</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PDUCHECK0</name>
                <description>Number of bits where Std and Hyper demodulator disagrees for minimum latency.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>PDUCHECK1</name>
                <description>Number of bits where Std and Hyper demodulator disagrees for medium latency.</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PDUCHECK2</name>
                <description>Number of bits where Std and Hyper demodulator disagrees for maximum latency.</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>HAM</name>
                <description>Hamming distance between std demod AA15:0 and expected AA15:0.</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>SPAM</name>
                <description>Time distance #bit clock cycles from AAmatchHyp.</description>
                <lsb>21</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>VALID</name>
                <description>Valid flag bit</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HYPSTDAADIFFVEC</name>
            <description>Address Diff Vector</description>
            <addressOffset>0x0AC</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DIFF</name>
                <description>Hyper AA15:0 and Std AA15:0 differs</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRWINSIZE</name>
            <description>Address match safe window size (the number of bits after detect is asserted, before starting to look for address match). Only valid when OVERRIDE22.DISABLEADDRWINDOW is '0'.</description>
            <addressOffset>0x0B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x1D111500</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IEEE802154</name>
                <description>Number of bits after detect to start search address/SFD in IEEE 802.15.4 mode Default value for classic 802.15.4 sync is 0x18</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>BLE</name>
                <description>Number of bits after detect to start search address/SFD in BLE mode</description>
                <lsb>8</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>LR</name>
                <description>Number of bits after detect to start search address/SFD in BLE_LR_125k/BLE_LR_500k mode</description>
                <lsb>16</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>ESB</name>
                <description>Number of bits after detect to start search address/SFD in ESB mode</description>
                <lsb>24</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MHRMATCHCONF</name>
            <description>Search pattern configuration</description>
            <addressOffset>0x0B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MHRMATCHCONF</name>
                <description>Search pattern configuration</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MHRMATCHMASK</name>
            <description>Pattern mask</description>
            <addressOffset>0x0B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MHRMATCHMASK</name>
                <description>Pattern mask</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
