adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <register>
            <name>SFD</name>
            <description>IEEE 802.15.4 start of frame delimiter</description>
            <addressOffset>0x0BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000A7</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SFD</name>
                <description>IEEE 802.15.4 start of frame delimiter. Note: the least significant 4 bits of the SFD cannot all be zeros.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CTEINLINECONF</name>
            <description>Configuration for CTE inline mode</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00002800</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CTEINLINECTRLEN</name>
                <description>Enable parsing of CTEInfo from received packet in BLE modes</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Parsing of CTEInfo is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Parsing of CTEInfo is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTEINFOINS1</name>
                <description>CTEInfo is S1 byte or not</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>InS1</name>
                    <description>CTEInfo is in S1 byte (data PDU)</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotInS1</name>
                    <description>CTEInfo is NOT in S1 byte (advertising PDU)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTEERRORHANDLING</name>
                <description>Sampling/switching if CRC is not OK</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>Sampling and antenna switching also when CRC is not OK</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>No</name>
                    <description>No sampling and antenna switching when CRC is not OK</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTEFORCEON</name>
                <description>CTE is continuously output after CRC and only stopped by triggering TASKS_STOP. This is typically used together with the DFEEND to STOP short. AoA/AoD procedure duration is still controlled by DFECTRL1.NUMBEROF8S / CTETIME</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Yes</name>
                    <description>CTE is continuously transmitted after CRC until TASKS_STOP</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>No</name>
                    <description>CTE duration is automatically determined by DFECTRL1.NUMBEROF8US / CTETIME (only correct for 1Mbps and 2Mbps modes)</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTETIMEVALIDRANGE</name>
                <description>Max range of CTETime</description>
                <lsb>6</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>20</name>
                    <description>20 in 8us unit (default) Set to 20 if parsed CTETime is larger han 20</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>31</name>
                    <description>31 in 8us unit</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>63</name>
                    <description>63 in 8us unit</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTEINLINERXMODE1US</name>
                <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
                <lsb>10</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8us</name>
                    <description>8us</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4us</name>
                    <description>4us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2us</name>
                    <description>2us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1us</name>
                    <description>1us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>500ns</name>
                    <description>0.5us</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>250ns</name>
                    <description>0.25us</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>125ns</name>
                    <description>0.125us</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CTEINLINERXMODE2US</name>
                <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
                <lsb>13</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8us</name>
                    <description>8us</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>4us</name>
                    <description>4us</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>2us</name>
                    <description>2us</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>1us</name>
                    <description>1us</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>500ns</name>
                    <description>0.5us</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>250ns</name>
                    <description>0.25us</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>125ns</name>
                    <description>0.125us</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0CONF</name>
                <description>S0 bit pattern to match</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>S0MASK</name>
                <description>S0 bit mask to set which bit to match</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMASTART</name>
            <description>Unspecified</description>
            <addressOffset>0x0C4</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMASTOP</name>
            <description>Unspecified</description>
            <addressOffset>0x0C8</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAENABLE</name>
            <description>Unspecified</description>
            <addressOffset>0x0CC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKETPTR</name>
            <description>Unspecified</description>
            <addressOffset>0x0D0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BASE</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAAMOUNT</name>
            <description>Unspecified</description>
            <addressOffset>0x0D4</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <lsb>0</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DMAMAXCNT</name>
            <description>Unspecified</description>
            <addressOffset>0x0D8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000103</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>CSTONES</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_CSTONES</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>MODE</name>
            <description>Selects the mode(s) that are activated on the start signal</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000003</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPM</name>
                <description>Enable or disable TPM</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>TPM is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>TPM is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TFM</name>
                <description>Enable or disable TFM</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>TFM is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>TFM is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>NUMSAMPLES</name>
            <description>Number of input samples at 2MHz sample rate</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x000000A0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMSAMPLES</name>
                <description>Maximum value supported is 160</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NEXTFREQUENCY</name>
            <description>The value of FREQUENCY that will be used in the next step</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NEXTFREQUENCY</name>
                <description>Frequency = 2400 + FREQUENCY (MHz)</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FFOIN</name>
            <description>Override value of FFO (Fractional Frequency Offset) if not to be based on the frequency estimate derived from CnAcc (autocorrelation of the scaled input signal) value</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFFIN</name>
                <description>Units 62.5 ppb. Max range +/-100 ppm plus margin.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FFOSOURCE</name>
            <description>Source of FFO</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFOSOURCE</name>
                <description>0: Use FFOIN 1: Calc FFO from CnAcc</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FAEPEER</name>
            <description>FAEPEER (Frequency Actuation Error) of peer if known. Used during Mode 0 steps.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FAEPEER</name>
                <description>Units 31.25 ppb.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHASESHIFT</name>
            <description>Parameter used in TPM, provided by software</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHASESHIFT</name>
                <description>Phase shift used in TPM calculation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NUMSAMPLESCOEFF</name>
            <description>Parameter used in TPM, provided by software</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000199A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NUMSAMPLESCOEFF</name>
                <description>Coefficient 1/(numSamples/16) in Q1.15 format (Default numsamples value is 160)</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCT16</name>
            <description>Mean magnitude and mean phase converted to IQ</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCT16I</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>PCT16Q</name>
                <description>Quadrature</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAGPHASEMEAN</name>
            <description>Mean magnitude and phase of the signal before it is converted to PCT16</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHASE</name>
                <description>Mean phase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MAG</name>
                <description>Mean magnitude</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IQRAWMEAN</name>
            <description>Mean of IQ values</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IQRAWMEANI</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>IQRAWMEANQ</name>
                <description>Quadrature</description>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAGSTD</name>
            <description>Magnitude standard deviation approximation</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAGSTD</name>
                <description>Magnitude standard deviation approximation</description>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNACC</name>
            <description>Output of the autocorrelation of the accumulated IQ signal</description>
            <addressOffset>0x030</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CNACCI</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CNACCQ</name>
                <lsb>16</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FFOEST</name>
            <description>FFO estimate</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FFOEST</name>
                <description>Units 62.5 ppb. Max range +/-100 ppm plus margin.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FINETUNENEXT</name>
            <description>Number of full ADPLL finetune steps</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FINETUNENEXT</name>
                <description>Units of 488.28125 Hz</description>
                <lsb>0</lsb>
                <msb>12</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CFOPHASE</name>
            <description>Cordic output of CnAcc</description>
            <addressOffset>0x040</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CFOPHASE</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
            </fields>
          </register>
