adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PCP[%s]</name>
            <description>Description collection:</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0xFFFFFFFC</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>AUTOCLOCKSOURCEREQ</name>
          <description>Unspecified</description>
          <addressOffset>0x1F3C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PCP_0</name>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCP_1</name>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCP_2</name>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCP_3</name>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCP_4</name>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>On</name>
                  <description>Unspecified</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Unspecified</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>FORCEOVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_FORCEOVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F40</addressOffset>
          <register>
            <dim>0x5</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PCP[%s]</name>
            <description>Description collection:</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLOCKFORCING</name>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>DOFORCECLOCK</name>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral derivedFrom="RADIO_NS">
      <name>RADIO_S</name>
      <description>2.4 GHz radio 1</description>
      <baseAddress>0x5302C000</baseAddress>
      <!--Security dma=NSA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RADIO_0</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>RADIO_1</name>
        <value>45</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LRCCONF000_S">
      <name>LRCCONF020_S</name>
      <description>LRCCONF 2</description>
      <baseAddress>0x5302E000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="PCGCM000_S">
      <name>PCGCM020_S</name>
      <description>PCGC Master 2</description>
      <baseAddress>0x5302F000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
    <peripheral derivedFrom="SPU000_S">
      <name>SPU030_S</name>
      <description>System protection unit 3</description>
      <baseAddress>0x53030000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <interrupt>
        <name>SPU030</name>
        <value>48</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PPIB020_S">
      <name>PPIB030_S</name>
      <description>PPIB APB registers 1</description>
      <baseAddress>0x53031000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
    </peripheral>
