adamkondraciuk/nrfx/mdk/nrf54h20_engb_radiocore.svd
        <cluster>
          <name>CONFIGNVR</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_CONFIGNVR</headerStructName>
          <access>read-write</access>
          <addressOffset>0x580</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PAGE[%s]</name>
            <description>Description collection: Configuration register for NVR page n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFC00000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WEN</name>
                <description>Write enable.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableWrite</name>
                    <description>Write is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableNormalWrite</name>
                    <description>Normal write is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableDirectWrite</name>
                    <description>Direct write is enabled</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EEN</name>
                <description>Erase enable.</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DisableErase</name>
                    <description>Erase is disabled but read is allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnablePageErase</name>
                    <description>Erase page and read are allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EnableWordErase</name>
                    <description>Erase word and read are allowed</description>
                    <value>0x2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LOCK</name>
                <description>Enables the lock for this register.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <modifiedWriteValues>oneToSet</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LockDisabled</name>
                    <description>Lock is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LockEnabled</name>
                    <description>Lock is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LREN</name>
                <description>Enable read access to the lower range of the NVR page, as defined by LRSIZE</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Read is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Read is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LWEN</name>
                <description>Enable write access to the lower range of the NVR page, as defined by LWSIZE</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Write is disabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Write is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>LRSIZE</name>
                <description>Size of part of the lower 2KB memory in the NVR page to disable read access</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>LWSIZE</name>
                <description>Size of part of the lower 2KB memory in the NVR page to disable write access</description>
                <lsb>28</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TEST</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_TEST</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>TESTMODE</name>
            <description>Register for entering test mode. Refer to the MRAM test flow documentation for 
      more details.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTMODE</name>
                <description>Register for entering test mode. This register does not return the same value 
        as written.</description>
                <lsb>0</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>NORMAL</name>
                    <description>Read: Not in test-mode.</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTMODE1</name>
                    <description>Read: In TESTMODE1.</description>
                    <value>0x0001</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TESTMODE2</name>
                    <description>Read: In TESTMODE2.</description>
                    <value>0x0002</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>SetNORMAL</name>
                    <description>Write: Sets NORMAL mode.</description>
                    <value>0x0000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SetTESTMODE1</name>
                    <description>Write: Sets TESTMODE1. Enables the mass erase.</description>
                    <value>0xBCDE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SetTESTMODE2</name>
                    <description>Write: Sets TESTMODE2. Used for production tests.</description>
                    <value>0xABCD</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LOCKTESTMODE</name>
            <description>Enables the lock for the TESTMODE</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EnableLock</name>
                <description>Enables the lock for TESTMODE.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <usage>read</usage>
                  <enumeratedValue>
                    <name>LockDisabled</name>
                    <description>Read: TESTMODE is not locked</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LockEnabled</name>
                    <description>Read: TESTMODE is locked</description>
                    <value>0x00000001</value>
                  </enumeratedValue>
                </enumeratedValues>
                <enumeratedValues>
                  <usage>write</usage>
                  <enumeratedValue>
                    <name>EnableLock</name>
                    <description>Write: Enables the lock (Ignores any other value written)</description>
                    <value>0x10CC10CC</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TESTMODE1</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_TESTMODE1</headerStructName>
          <access>read-write</access>
          <addressOffset>0x608</addressOffset>
          <register>
            <name>MASSERASE</name>
            <description>Self-timed mass-erase operation.</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASSERASE</name>
                <description>Self-timed mass-erase operation.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EVERYTHING</name>
                    <description>Erase everything in the MRAM including all NVR pages</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MAIN</name>
                    <description>Erase only the main block</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOOPERATION1</name>
                    <description>No operation</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NOOPERATION0</name>
                    <description>No operation</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TESTMODE2</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_MRAMC_TESTMODE2</headerStructName>
          <access>read-write</access>
          <addressOffset>0x610</addressOffset>
          <cluster>
            <name>MRAM</name>
            <description>Unspecified</description>
            <headerStructName>GLOBAL_MRAMC_TESTMODE2_MRAM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>IN</name>
              <description>Writes to the input control signals to the MRAM. Read to this registers
                  reads back the last written value.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLK</name>
                  <description>Clock for synchronous Read</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>RDEN</name>
                  <description>Read Enable</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>NVR</name>
                  <description>Select NVR pages/sectors</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                </field>
                <field>
                  <name>CEb</name>
                  <description>Chip Enable</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>WEb</name>
                  <description>Write Enable</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PROGEN</name>
                  <description>Program Enable</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                </field>
                <field>
                  <name>PROG</name>
                  <description>Program signal</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                </field>
                <field>
                  <name>ERASE</name>
                  <description>Erase signal</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>SCE</name>
                  <description>Sector Erase</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CHIP</name>
                  <description>Chip Erase</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                </field>
                <field>
                  <name>PEON</name>
                  <description>Read within program/erase</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                </field>
                <field>
                  <name>PORb</name>
                  <description>Power On Reset (active low)</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>RSTb</name>
                  <description>Trim Configuration Register Reset (active low)</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>SHIFT</name>
                  <description>Trim Configuration Shift</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                </field>
                <field>
                  <name>SUPD</name>
                  <description>Trim Configuration Upload</description>
                  <lsb>14</lsb>
                  <msb>14</msb>
                </field>
                <field>
                  <name>SDI</name>
                  <description>Trim Configuration Input</description>
                  <lsb>15</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>SCLK</name>
                  <description>Trim Configuration Clock</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                </field>
                <field>
                  <name>RETb</name>
                  <description>Trim Configuration Register Retention (active low)</description>
                  <lsb>17</lsb>
                  <msb>17</msb>
                </field>
                <field>
                  <name>ECCBYPS</name>
                  <description>Bypass ECC Encoder and Decoder</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>DPD</name>
                  <description>Deep Power Down</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>TMEN</name>
                  <description>Test Mode Enable</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>OUT</name>
              <description>The output control signals from the MRAM</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SDO</name>
                  <description>Trim Configuration Register Output</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EC</name>
                  <description>ECC Error Correction</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>UE</name>
                  <description>ECC Unrecoverable Error</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>DONE</name>
              <description>The DONE signal of the MRAM</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DONE</name>
                  <description>Program/Erase Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RDY</name>
              <description>The RDY signal of the MRAM</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RDY</name>
                  <description>Read Status</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data word n to/from MRAM data in/out bus.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATA</name>
                <description>Returns data from the MRAM data out bus on reading. 
                  Sets the data to the MRAM data in bus on writing.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATAECC</name>
            <description>ECC bits to/from MRAM data in/out bus.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECC</name>
                <description>Returns ECC bits from the MRAM data out bus on reading. 
                  Sets the ECC bits to the MRAM data in bus on writing.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDR</name>
            <description>Address bits of the MRAM address bus. The register is updated when the
      auto-increment is done.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x0007FFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>YADDR</name>
                <description>Control the YADDR lines. The YADDR is incremented on auto-increment
        and the XADDR is incremented by one when the YADDR overflow during increment.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>XADDR</name>
                <description>Control the XADDR lines</description>
                <lsb>7</lsb>
                <msb>18</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATAINC[%s]</name>
            <description>Description collection: Same as DATA but post-increments address after the read from the bus.</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Read or write data.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATAECCINC</name>
            <description>Same as DATAECC but post-increments ADDR after the read from the bus.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ECC</name>
                <description>ECC bits.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
